<?php

use PHPUnit\Framework\TestCase;

class YandexMoneyParserTest extends TestCase
{
    public function provider()
    {
        return [
            [
                "Пароль: 1234 
                Спишется 31,27р. 
                Перевод на счет 410011435701025",
                "1234", "31,27р", "410011435701025"
            ],
            [
                "Пароль: 4384
                Спишется 238,48р.
                Перевод на счет 410011435701025",
                "4384", "238,48р", "410011435701025"
            ],
            [
                "Пароль: 8998
                Спишется 2349,00р.
                Перевод на счет 410011435701025",
                "8998", "2349,00р", "410011435701025"
            ],
            [
                "Пароль: 5833
                Спишется 4821р.
                Перевод на счет 410011435701025",
                "5833", "4821р", "410011435701025"
            ],
            [
                "Пароль: 1234 Спишется 482р. Перевод на счет 410011435701025",
                "1234", "482р", "410011435701025"
            ],
            [
                "Перевод на счет 410011435701025 Пароль: 1234 Спишется 482р.",
                "1234", "482р", "410011435701025"
            ],
            [
                "Перевод на счет 410011435701025 Пароль:1234 Спишется 482р.",
                "1234", "482р", "410011435701025"
            ],
            [
                "Перевод на счет 410011435701025.Пароль:1234.Спишется 482р.",
                "1234", "482р", "410011435701025"
            ],
            [
                "Пароль: 3456Спишется 482р. Перевод на счет 410011435701025",
                "3456", "482р", "410011435701025"
            ],
            [
                "Пароль: 3456Спишется 1234р.Перевод на счет 410011435701025",
                "3456", "1234р", "410011435701025"
            ],
        ];
    }

    /**
     * @dataProvider provider
     */
    public function testParse($textSms, $code, $sum, $wallet)
    {
        $parse = new YandexMoneySmsParser();
        $valueDto = $parse->parseTextSms($textSms);

        $this->assertEquals($valueDto->code, $code);
        $this->assertEquals($valueDto->sum, $sum);
        $this->assertEquals($valueDto->wallet, $wallet);
    }
}